
# 문제4: "모스 부호 변환기"
# 사용자로부터 영문 텍스트를 입력받아 해당 텍스트를 모스 부호로 변환하는 프로그램을 작성하세요.
# 각 알파벳과 숫자에 대응하는 모스 부호를 사전에 정의해야 합니다.

# 모스부호 문자열
morse_collection = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
    'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
    'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..',
    '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..', '9': '----.',
    '.': '.-.-.-', ',': '--..--', '?': '..--..', "'": '.----.', '!': '-.-.--', '/': '-..-.',
    '(': '-.--.', ')': '-.--.-', '&': '.-...', ':': '---...', ';': '-.-.-.', '=': '-...-',
    '+': '.-.-.', '-': '-....-', '_': '..--.-', '"': '.-..-.', '$': '...-..-', '@': '.--.-.'}
# 인풋 
user_input = input("영문 텍스트를 입력해주세요").upper()
# 존재하지 않은 문자 있을경우
# encoding_str1 = list(user_input) # 띄어쓰기 Keyerror
encoding_str1 = [user_input[i] for i in range(len(user_input)) if user_input[i] in morse_collection]


encoding_msg = ""
print(encoding_str1, type(encoding_str1))
for i in encoding_str1:
        encoding_msg += morse_collection[i]

print(encoding_msg.strip())


# 인풋 -> 아스키코드 
# 모스부호 문자열 아스키코드 매칭
